src/cf/DataProcessors/вогРотацияАссортиментаСтарая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>вогРотацияАссортиментаСтарая</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>АртикулыНаСтендах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Стенд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогСтенды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторона</Name>
							<Type>
								<v8:Type>cfg:EnumRef.вогСтороныСтендов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогСтилиРисункаОбоев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыABC</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиКлиент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтенда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусБренд</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыABC</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/вогРотацияАссортиментаСтарая/Forms/ФормаРедактированияКорзины/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ПараметрыПередЗакрытием = Ложь;
	СписокАртикулов = Новый Массив;
	Для Каждого Строка Из ТаблицаАртикулов Цикл
		СтруктураСтроки = Новый Структура("Стенд,Артикул,НомерСтенда");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Строка);
		СписокАртикулов.Добавить(СтруктураСтроки);
	КонецЦикла;
	ПараметрыЗакрытия = Новый Структура("СписокАртикулов",СписокАртикулов);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокАртикулов") 
			И Параметры.СписокАртикулов.Количество() > 0 Тогда
		Для Каждого Строка Из Параметры.СписокАртикулов Цикл
			НоваяСтрока = ТаблицаАртикулов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ПараметрыПередЗакрытием = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы И ПараметрыПередЗакрытием Тогда
		Отказ = Истина;
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыПередЗакрытием = Ложь;
	СписокАртикулов = Новый Массив;
	Для Каждого Строка Из ТаблицаАртикулов Цикл
		СтруктураСтроки = Новый Структура("Стенд,Артикул,НомерСтенда");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Строка);
		СписокАртикулов.Добавить(СтруктураСтроки);
	КонецЦикла;
	ПараметрыЗакрытия = Новый Структура("СписокАртикулов",СписокАртикулов);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры
